<a href="https://colab.research.google.com/github/faizdifak/Big-Data/blob/main/Pertemuan%2010%20MongoDB%20Implemetasi_NOSQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from pymongo import MongoClient

client = MongoClient("mongodb://localhost:27017/")

db = client["company_db"]
collection = db["employees"]
print("✅ Connected to MongoDB")

✅ Connected to MongoDB

In [ ]:
# Tugas 2
# Contoh Insert Data
employee_data = {
    'name' : 'Rusdi',
    'department' : 'Finance',
    'age' : 30,
    'Salary' : 5000
}
collection.insert_one(employee_data)
print("Data Inserted")

# Insert beberapa data sekaligus (multiple insert)
multiple_employees = [
    {'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 5500},
    {'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200},
    {'name': 'Diana', 'department': 'Finance', 'age': 35, 'salary': 6000},
    {'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 4800}
]
collection.insert_many(multiple_employees)
print("Beberapa data berhasil dimasukkan!")
print("=== Data Pegawai ===")
for emp in collection.find():
    print(emp)

Data Inserted
Beberapa data berhasil dimasukkan!
=== Data Pegawai ===
{'_id': ObjectId('6902c044692353dda442a8c6'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6050.000000000001}
{'_id': ObjectId('6902c044692353dda442a8c9'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5280.0}
{'_id': ObjectId('6902c061692353dda442a8cb'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6050.000000000001}
{'_id': ObjectId('6902c061692353dda442a8ce'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5280.0}
{'_id': ObjectId('6902c98d692353dda442a8cf'), 'name': 'Rusdi', 'department': 'Finance', 'age': 30, 'Salary': 5000}
{'_id': ObjectId('6902c98d692353dda442a8d0'), 'name': 'Ratih', 'department': 'HR', 'age': 32, 'salary': 5500}
{'_id': ObjectId('6902c98d692353dda442a8d1'), 'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200}
{'_id': ObjectId('6902c98d692353dda442a8d2'), 'name': 'Diana', 'department': 'Finance', 'age': 35, 'salary': 6000}
{'_id': ObjectId('6902c98d692353dda442a8d3'), 'name': 'Noni', 'department': 'IT', 'age': 25, 'salary': 4800}
{'_id': ObjectId('69037f314dfe8957025d5787'), 'name': 'Rusdi', 'department': 'Finance', 'age': 30, 'Salary': 5000}
{'_id': ObjectId('69037f324dfe8957025d5788'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 5500}
{'_id': ObjectId('69037f324dfe8957025d5789'), 'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200}
{'_id': ObjectId('69037f324dfe8957025d578a'), 'name': 'Diana', 'department': 'Finance', 'age': 35, 'salary': 6000}
{'_id': ObjectId('69037f324dfe8957025d578b'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 4800}

In [ ]:
# Update banyak dokumen
collection.update_many(
    {'department': 'IT'},
    {'$mul': {'salary': 1.10}}  # Naik 10%
)
print("Gaji pegawai di IT naik 10%!")

# Tampilkan hasil setelah update
for emp in collection.find({'department': 'IT'}):
    print(emp)

Gaji pegawai di IT naik 10%!
{'_id': ObjectId('6902c044692353dda442a8c6'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6655.000000000002}
{'_id': ObjectId('6902c044692353dda442a8c9'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5808.000000000001}
{'_id': ObjectId('6902c061692353dda442a8cb'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6655.000000000002}
{'_id': ObjectId('6902c061692353dda442a8ce'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5808.000000000001}
{'_id': ObjectId('6902c98d692353dda442a8d3'), 'name': 'Noni', 'department': 'IT', 'age': 25, 'salary': 5280.0}
{'_id': ObjectId('69037f324dfe8957025d5788'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6050.000000000001}
{'_id': ObjectId('69037f324dfe8957025d578b'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5280.0}

In [ ]:
collection.update_one(
    {'name': 'Rusdi'},
    {'$set': {'name': 'Rusdiana'}}
)
print("Nama Rusdi diupdate menjadi Rusdiana.")

Nama Rusdi diupdate menjadi Rusdiana.

In [ ]:
print("=== Data Pegawai ===")
for emp in collection.find():
    print(emp)

=== Data Pegawai ===
{'_id': ObjectId('6902c044692353dda442a8c6'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6655.000000000002}
{'_id': ObjectId('6902c044692353dda442a8c9'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5808.000000000001}
{'_id': ObjectId('6902c061692353dda442a8cb'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6655.000000000002}
{'_id': ObjectId('6902c061692353dda442a8ce'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5808.000000000001}
{'_id': ObjectId('6902c98d692353dda442a8cf'), 'name': 'Rusdiana', 'department': 'Finance', 'age': 30, 'Salary': 5000}
{'_id': ObjectId('6902c98d692353dda442a8d0'), 'name': 'Ratih', 'department': 'HR', 'age': 32, 'salary': 5500}
{'_id': ObjectId('6902c98d692353dda442a8d1'), 'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200}
{'_id': ObjectId('6902c98d692353dda442a8d2'), 'name': 'Diana', 'department': 'Finance', 'age': 35, 'salary': 6000}
{'_id': ObjectId('6902c98d692353dda442a8d3'), 'name': 'Noni', 'department': 'IT', 'age': 25, 'salary': 5280.0}
{'_id': ObjectId('69037f314dfe8957025d5787'), 'name': 'Rusdi', 'department': 'Finance', 'age': 30, 'Salary': 5000}
{'_id': ObjectId('69037f324dfe8957025d5788'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6050.000000000001}
{'_id': ObjectId('69037f324dfe8957025d5789'), 'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200}
{'_id': ObjectId('69037f324dfe8957025d578a'), 'name': 'Diana', 'department': 'Finance', 'age': 35, 'salary': 6000}
{'_id': ObjectId('69037f324dfe8957025d578b'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5280.0}

In [ ]:
# Hapus satu dokumen
collection.delete_one({'name': 'Rita'})
print("Data Rita dihapus")

Data Rita dihapus

In [ ]:
# Hapus banyak dokumen
collection.delete_many({'department': 'Finance'})
print("Semua pegawai Finance dihapus.")

Semua pegawai Finance dihapus.

In [ ]:
print("=== Data Setelah Delete ===")
for emp in collection.find():
    print(emp)

=== Data Setelah Delete ===
{'_id': ObjectId('6902c044692353dda442a8c6'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6655.000000000002}
{'_id': ObjectId('6902c044692353dda442a8c9'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5808.000000000001}
{'_id': ObjectId('6902c061692353dda442a8cb'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6655.000000000002}
{'_id': ObjectId('6902c061692353dda442a8ce'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5808.000000000001}
{'_id': ObjectId('6902c98d692353dda442a8d0'), 'name': 'Ratih', 'department': 'HR', 'age': 32, 'salary': 5500}
{'_id': ObjectId('6902c98d692353dda442a8d3'), 'name': 'Noni', 'department': 'IT', 'age': 25, 'salary': 5280.0}
{'_id': ObjectId('69037f324dfe8957025d5788'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6050.000000000001}
{'_id': ObjectId('69037f324dfe8957025d5789'), 'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200}
{'_id': ObjectId('69037f324dfe8957025d578b'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5280.0}

In [ ]:
# Tugas 3
pipeline = [
    {'$group' : {'_id': '$department', 'average_salary': {'$avg': '$salary'}}}
]
for result in collection.aggregate(pipeline):
    print(result)

{'_id': 'HR', 'average_salary': 4850.0}
{'_id': 'IT', 'average_salary': 5933.714285714287}

In [ ]:
# Contoh Insert Data
employee_data = {
    'name' : 'Rusdi',
    'department' : 'Finance',
    'age' : 30,
    'Salary' : 5000
}
collection.insert_one(employee_data)
print("Data Inserted")

# Insert beberapa data sekaligus (multiple insert)
multiple_employees = [
    {'name': 'Ratih', 'department': 'HR', 'age': 32, 'salary': 5500},
    {'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200},
    {'name': 'Diana', 'department': 'Finance', 'age': 35, 'salary': 6000},
    {'name': 'Noni', 'department': 'IT', 'age': 25, 'salary': 4800}
]
collection.insert_many(multiple_employees)
print("Beberapa data berhasil dimasukkan!")
print("=== Data Pegawai ===")
for emp in collection.find():
    print(emp)

Data Inserted
Beberapa data berhasil dimasukkan!
=== Data Pegawai ===
{'_id': ObjectId('6902c044692353dda442a8c6'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6655.000000000002}
{'_id': ObjectId('6902c044692353dda442a8c9'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5808.000000000001}
{'_id': ObjectId('6902c061692353dda442a8cb'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6655.000000000002}
{'_id': ObjectId('6902c061692353dda442a8ce'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5808.000000000001}
{'_id': ObjectId('6902c98d692353dda442a8d0'), 'name': 'Ratih', 'department': 'HR', 'age': 32, 'salary': 5500}
{'_id': ObjectId('6902c98d692353dda442a8d3'), 'name': 'Noni', 'department': 'IT', 'age': 25, 'salary': 5280.0}
{'_id': ObjectId('69037f324dfe8957025d5788'), 'name': 'Agus', 'department': 'IT', 'age': 32, 'salary': 6050.000000000001}
{'_id': ObjectId('69037f324dfe8957025d5789'), 'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200}
{'_id': ObjectId('69037f324dfe8957025d578b'), 'name': 'Gatot', 'department': 'IT', 'age': 25, 'salary': 5280.0}
{'_id': ObjectId('69037f324dfe8957025d578c'), 'name': 'Rusdi', 'department': 'Finance', 'age': 30, 'Salary': 5000}
{'_id': ObjectId('69037f324dfe8957025d578d'), 'name': 'Ratih', 'department': 'HR', 'age': 32, 'salary': 5500}
{'_id': ObjectId('69037f324dfe8957025d578e'), 'name': 'Rita', 'department': 'HR', 'age': 27, 'salary': 4200}
{'_id': ObjectId('69037f324dfe8957025d578f'), 'name': 'Diana', 'department': 'Finance', 'age': 35, 'salary': 6000}
{'_id': ObjectId('69037f324dfe8957025d5790'), 'name': 'Noni', 'department': 'IT', 'age': 25, 'salary': 4800}

In [ ]:
from pymongo import MongoClient
import pandas as pd

# Koneksi MongoDB lokal
client = MongoClient("mongodb://localhost:27017/")

# Pilih database
db = client["toko_online"]

# Buat koleksi baru untuk produk
products = db["products"]

print("Koneksi ke database 'toko_online' berhasil!")

Koneksi ke database 'toko_online' berhasil!

In [ ]:
# Hapus data lama agar tidak dobel (opsional)
products.delete_many({})

# Masukkan data produk
produk_list = [
    {"nama": "Laptop Asus", "kategori": "Elektronik", "harga": 8500000, "stok": 10},
    {"nama": "Smartphone Samsung", "kategori": "Elektronik", "harga": 6500000, "stok": 15},
    {"nama": "Headphone JBL", "kategori": "Elektronik", "harga": 1200000, "stok": 20},
    {"nama": "Kemeja Pria", "kategori": "Fashion", "harga": 250000, "stok": 30},
    {"nama": "Celana Jeans", "kategori": "Fashion", "harga": 350000, "stok": 25},
    {"nama": "Sepatu Nike", "kategori": "Fashion", "harga": 950000, "stok": 18},
    {"nama": "Buku Pemrograman Python", "kategori": "Buku", "harga": 150000, "stok": 40},
    {"nama": "Buku Filsafat", "kategori": "Buku", "harga": 175000, "stok": 35},
    {"nama": "Snack Ring", "kategori": "Makanan", "harga": 8000, "stok": 100},
    {"nama": "Coklat Silverqueen", "kategori": "Makanan", "harga": 25000, "stok": 80}
]

# Insert data ke koleksi
products.insert_many(produk_list)
print("✅ 10 produk berhasil dimasukkan!")

✅ 10 produk berhasil dimasukkan!

In [ ]:
# Hitung rata-rata harga produk
avg_price = list(products.aggregate([
    {"$group": {"_id": None, "rata_rata_harga": {"$avg": "$harga"}}}
]))[0]["rata_rata_harga"]

print(f"Rata-rata harga produk: Rp{avg_price:,.0f}")

Rata-rata harga produk: Rp1,810,800

In [ ]:
print("=== Produk dengan harga di atas rata-rata ===")
for p in products.find({"harga": {"$gt": avg_price}}):
    print(p)

=== Produk dengan harga di atas rata-rata ===
{'_id': ObjectId('69037f324dfe8957025d5792'), 'nama': 'Laptop Asus', 'kategori': 'Elektronik', 'harga': 8500000, 'stok': 10}
{'_id': ObjectId('69037f324dfe8957025d5793'), 'nama': 'Smartphone Samsung', 'kategori': 'Elektronik', 'harga': 6500000, 'stok': 15}

In [ ]:
# Tampilkan di DataFrame Pandas
data_df = pd.DataFrame(list(products.find({"harga": {"$gt": avg_price}}, {"_id": 0})))
data_df

                 nama    kategori    harga  stok
0         Laptop Asus  Elektronik  8500000    10
1  Smartphone Samsung  Elektronik  6500000    15

In [ ]:
pipeline = [
    {"$group": {"_id": "$kategori", "total_produk": {"$sum": 1}}},
    {"$sort": {"total_produk": -1}}
]

hasil = list(products.aggregate(pipeline))

print("=== Total Produk per Kategori ===")
for h in hasil:
    print(f"{h['_id']}: {h['total_produk']} produk")

=== Total Produk per Kategori ===
Fashion: 3 produk
Elektronik: 3 produk
Makanan: 2 produk
Buku: 2 produk

In [ ]:
pd.DataFrame(hasil)

          _id  total_produk
0     Fashion             3
1  Elektronik             3
2     Makanan             2
3        Buku             2

In [ ]:
from pymongo import MongoClient
import pandas as pd

client = MongoClient("mongodb://localhost:27017/")
db = client["perusahaan"]
collection = db["pegawai"]

print("Koneksi berhasil ke database perusahaan!")

Koneksi berhasil ke database perusahaan!

In [ ]:
# Dataset pegawai baru (19 orang)
employee_list = [
    {"name": "Alice", "department": "Finance", "age": 29, "salary": 4500},
    {"name": "Bob", "department": "IT", "age": 32, "salary": 5500},
    {"name": "Charlie", "department": "HR", "age": 27, "salary": 4200},
    {"name": "Eve", "department": "IT", "age": 25, "salary": 4800},
    {"name": "Frank", "department": "Finance", "age": 31, "salary": 5200},
    {"name": "Grace", "department": "IT", "age": 28, "salary": 7000},
    {"name": "Henry", "department": "Finance", "age": 24, "salary": 3900},
    {"name": "Ivy", "department": "Marketing", "age": 30, "salary": 5100},
    {"name": "Jack", "department": "Marketing", "age": 26, "salary": 4700},
    {"name": "Karen", "department": "HR", "age": 33, "salary": 4600},
    {"name": "Leo", "department": "Finance", "age": 37, "salary": 6800},
    {"name": "Mia", "department": "IT", "age": 29, "salary": 7200},
    {"name": "Nina", "department": "Finance", "age": 28, "salary": 5100},
    {"name": "Oscar", "department": "Marketing", "age": 22, "salary": 4000},
    {"name": "Paul", "department": "Finance", "age": 27, "salary": 4700},
    {"name": "Quinn", "department": "IT", "age": 23, "salary": 4300},
    {"name": "Rachel", "department": "HR", "age": 31, "salary": 5200},
    {"name": "Steve", "department": "Marketing", "age": 34, "salary": 5800},
    {"name": "Tina", "department": "IT", "age": 40, "salary": 8000}
]

# Insert data ke koleksi
collection.insert_many(employee_list)
print(" 19 data pegawai berhasil dimasukkan!")

 19 data pegawai berhasil dimasukkan!

In [ ]:
print("=== Semua Data Pegawai ===")
for emp in collection.find({}, {"_id": 0}):
    print(emp)

=== Semua Data Pegawai ===
{'name': 'Alice', 'department': 'Finance', 'age': 29, 'salary': 4500}
{'name': 'Bob', 'department': 'IT', 'age': 32, 'salary': 5500}
{'name': 'Charlie', 'department': 'HR', 'age': 27, 'salary': 4200}
{'name': 'Eve', 'department': 'IT', 'age': 25, 'salary': 4800}
{'name': 'Frank', 'department': 'Finance', 'age': 31, 'salary': 5200}
{'name': 'Grace', 'department': 'IT', 'age': 28, 'salary': 7000}
{'name': 'Henry', 'department': 'Finance', 'age': 24, 'salary': 3900}
{'name': 'Ivy', 'department': 'Marketing', 'age': 30, 'salary': 5100}
{'name': 'Jack', 'department': 'Marketing', 'age': 26, 'salary': 4700}
{'name': 'Karen', 'department': 'HR', 'age': 33, 'salary': 4600}
{'name': 'Leo', 'department': 'Finance', 'age': 37, 'salary': 6800}
{'name': 'Mia', 'department': 'IT', 'age': 29, 'salary': 7200}
{'name': 'Nina', 'department': 'Finance', 'age': 28, 'salary': 5100}
{'name': 'Oscar', 'department': 'Marketing', 'age': 22, 'salary': 4000}
{'name': 'Paul', 'department': 'Finance', 'age': 27, 'salary': 4700}
{'name': 'Quinn', 'department': 'IT', 'age': 23, 'salary': 4300}
{'name': 'Rachel', 'department': 'HR', 'age': 31, 'salary': 5200}
{'name': 'Steve', 'department': 'Marketing', 'age': 34, 'salary': 5800}
{'name': 'Tina', 'department': 'IT', 'age': 40, 'salary': 8000}

In [ ]:
# Tugas Tambahan
# Tugas 1
pipeline_top5 = [
    {"$sort": {"department": 1, "salary": -1}},  # Urutkan berdasarkan departemen & gaji tertinggi
    {"$group": {
        "_id": "$department",
        "top5": {"$push": {"nama": "$name", "gaji": "$salary", "umur": "$age"}},
    }},
    {"$project": {
        "_id": 1,
        "top5": {"$slice": ["$top5", 5]}  # Ambil 5 teratas per departemen
    }}
]

top5_result = list(collection.aggregate(pipeline_top5))

print("=== 5 Karyawan dengan Gaji Tertinggi per Departemen ===")
for dept in top5_result:
    print(f"\nDepartemen: {dept['_id']}")
    for emp in dept["top5"]:
        print(f"  - {emp['nama']} | Gaji: {emp['gaji']} | Umur: {emp['umur']}")

=== 5 Karyawan dengan Gaji Tertinggi per Departemen ===

Departemen: Finance
  - Leo | Gaji: 6800 | Umur: 37
  - Leo | Gaji: 6800 | Umur: 37
  - Frank | Gaji: 5200 | Umur: 31
  - Frank | Gaji: 5200 | Umur: 31
  - Nina | Gaji: 5100 | Umur: 28

Departemen: Marketing
  - Steve | Gaji: 5800 | Umur: 34
  - Steve | Gaji: 5800 | Umur: 34
  - Ivy | Gaji: 5100 | Umur: 30
  - Ivy | Gaji: 5100 | Umur: 30
  - Jack | Gaji: 4700 | Umur: 26

Departemen: HR
  - Rachel | Gaji: 5200 | Umur: 31
  - Rachel | Gaji: 5200 | Umur: 31
  - Karen | Gaji: 4600 | Umur: 33
  - Karen | Gaji: 4600 | Umur: 33
  - Charlie | Gaji: 4200 | Umur: 27

Departemen: IT
  - Tina | Gaji: 8000 | Umur: 40
  - Tina | Gaji: 8000 | Umur: 40
  - Mia | Gaji: 7200 | Umur: 29
  - Mia | Gaji: 7200 | Umur: 29
  - Grace | Gaji: 7000 | Umur: 28

In [ ]:
data_top5 = []
for dept in top5_result:
    for emp in dept["top5"]:
        data_top5.append({
            "Departemen": dept["_id"],
            "Nama": emp["nama"],
            "Gaji": emp["gaji"],
            "Umur": emp["umur"]
        })

pd.DataFrame(data_top5)

   Departemen     Nama  Gaji  Umur
0     Finance      Leo  6800    37
1     Finance      Leo  6800    37
2     Finance    Frank  5200    31
3     Finance    Frank  5200    31
4     Finance     Nina  5100    28
5   Marketing    Steve  5800    34
6   Marketing    Steve  5800    34
7   Marketing      Ivy  5100    30
8   Marketing      Ivy  5100    30
9   Marketing     Jack  4700    26
10         HR   Rachel  5200    31
11         HR   Rachel  5200    31
12         HR    Karen  4600    33
13         HR    Karen  4600    33
14         HR  Charlie  4200    27
15         IT     Tina  8000    40
16         IT     Tina  8000    40
17         IT      Mia  7200    29
18         IT      Mia  7200    29
19         IT    Grace  7000    28

In [ ]:
# Tugas 2
# Hitung dulu berapa yang akan dihapus
count_under30 = collection.count_documents({"age": {"$lt": 30}})
print(f"Ada {count_under30} karyawan berusia di bawah 25 tahun.")

# Hapus karyawan dengan usia < 30
collection.delete_many({"age": {"$lt": 30}})
print("Semua karyawan di bawah 30 tahun berhasil dihapus!")

# Verifikasi
for emp in collection.find({}, {"_id": 0, "name": 1, "age": 1}):
    print(emp)

Ada 22 karyawan berusia di bawah 25 tahun.
Semua karyawan di bawah 30 tahun berhasil dihapus!
{'name': 'Bob', 'age': 32}
{'name': 'Frank', 'age': 31}
{'name': 'Ivy', 'age': 30}
{'name': 'Karen', 'age': 33}
{'name': 'Leo', 'age': 37}
{'name': 'Rachel', 'age': 31}
{'name': 'Steve', 'age': 34}
{'name': 'Tina', 'age': 40}
{'name': 'Bob', 'age': 32}
{'name': 'Frank', 'age': 31}
{'name': 'Ivy', 'age': 30}
{'name': 'Karen', 'age': 33}
{'name': 'Leo', 'age': 37}
{'name': 'Rachel', 'age': 31}
{'name': 'Steve', 'age': 34}
{'name': 'Tina', 'age': 40}

In [ ]:
# Tugas 3
pipeline_report = [
    {"$group": {
        "_id": "$department",
        "total_gaji": {"$sum": "$salary"},
        "rata_umur": {"$avg": "$age"},
        "jumlah_karyawan": {"$sum": 1}
    }},
    {"$sort": {"_id": 1}}
]

laporan = list(collection.aggregate(pipeline_report))

print("=== Laporan Ringkas Gaji & Umur per Departemen ===")
for row in laporan:
    print(f"Departemen: {row['_id']}")
    print(f"  Total Gaji     : {row['total_gaji']}")
    print(f"  Rata-rata Umur : {row['rata_umur']:.2f}")
    print(f"  Jumlah Karyawan: {row['jumlah_karyawan']}\n")

=== Laporan Ringkas Gaji & Umur per Departemen ===
Departemen: Finance
  Total Gaji     : 24000
  Rata-rata Umur : 34.00
  Jumlah Karyawan: 4

Departemen: HR
  Total Gaji     : 19600
  Rata-rata Umur : 32.00
  Jumlah Karyawan: 4

Departemen: IT
  Total Gaji     : 27000
  Rata-rata Umur : 36.00
  Jumlah Karyawan: 4

Departemen: Marketing
  Total Gaji     : 21800
  Rata-rata Umur : 32.00
  Jumlah Karyawan: 4